import React from 'react';
import './Blogs.css'
const Blogs = () => {
    return (
        <div>
            <div className='style'>
                <h3>What is context api?</h3>
                <p> কনটেক্সট এপিআই হল একটি রিঅ্যাক্ট স্ট্রাকচার যা আপনাকে অনন্য বিবরণ আদান-প্রদান করতে সক্ষম করে এবং আপনার অ্যাপ্লিকেশনের সমস্ত স্তর থেকে প্রপ-ড্রিলিং সমাধানে সহায়তা করে |</p>
            </div>

            <div className='style'>
                <h3>What is semantic tag?</h3>
                <p>
                    শব্দার্থিক এইচটিএমএল উপাদানগুলি এমন যেগুলি মানুষের এবং মেশিন-পাঠযোগ্য উপায়ে তাদের অর্থ স্পষ্টভাবে বর্ণনা করে সেগুলো হচ্চে সিমান্টিক ট্যাগ। যেমন ঃ article,header, footer</p>
            </div>

            <div className='style'>
                <h3>What is inline and block line element?</h3>
                <p>ইনলাইন ইলিমেন্ট হল সেইগুলি যা উপাদানের প্রবাহকে ভাঙার পরিবর্তে উপাদানটিকে সংজ্ঞায়িত ট্যাগ দ্বারা আবদ্ধ স্থান দখল করে।
                    একটি ইনলাইন উপাদান একটি নতুন লাইনে শুরু হয় না এবং শুধুমাত্র যতটা প্রয়োজন ততটা প্রস্থ নেয়
                </p>

                <p className='al'>একটি ব্লক-লেবেল উপাদান হল  HTML উপাদান যা একটি ওয়েব পৃষ্ঠায় একটি নতুন লাইন শুরু করে এবং এর মূল উপাদানটির উপলব্ধ অনুভূমিক স্থানের সম্পূর্ণ প্রস্থকে প্রসারিত করে। এটি অনুচ্ছেদ বা পৃষ্ঠা বিভাজনের মতো বিষয়বস্তুর বড় ব্লক তৈরি করে</p>
            </div>
        </div>
    );
};

export default Blogs;